alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/IKKI/IKKI_main.c
      SD16A_configuration->analog_input[0] = EEG3; // 1: A1 - EEG3
      SD16A_configuration->analog_input[1] = EEG2; // 2: A2 - EEG2
      SD16A_configuration->analog_input[2] = EEG1; // 3: A3 - EEG1
      SD16A_configuration->analog_input[3] = BATT; // 4: A4 - BATT

      SD16A_configuration->analog_input_ID[0] = 0x30; // 1: A1 - EEG3
      SD16A_configuration->analog_input_ID[1] = 0x31; // 2: A2 - EEG2
      SD16A_configuration->analog_input_ID[2] = 0x32; // 3: A3 - EEG1
      SD16A_configuration->analog_input_ID[3] = 0x33; // 4: A4 - BATT

#elif (ECG_or_EEG==5)
      SD16A_configuration->analog_input_count = 5;

      SD16A_configuration->analog_input[0] = ECG;  // 0: A0 - ECG
      SD16A_configuration->analog_input[1] = EEG3; // 2: A2 - EEG2
      SD16A_configuration->analog_input[2] = EEG2; // 1: A1 - EEG3
      SD16A_configuration->analog_input[3] = EEG1; // 3: A3 - EEG1
      SD16A_configuration->analog_input[4] = BATT; // 4: A4 - BATT

      SD16A_configuration->analog_input_ID[0] = 0x30; // 0: A0 - ECG
      SD16A_configuration->analog_input_ID[1] = 0x31; // 2: A2 - EEG2
      SD16A_configuration->analog_input_ID[2] = 0x32; // 1: A1 - EEG3
      SD16A_configuration->analog_input_ID[3] = 0x33; // 3: A3 - EEG1
      SD16A_configuration->analog_input_ID[4] = 0x34; // 4: A4 - BATT
#endif

      // -- Tensión de referencia
      SD16A_configuration->v_ref = 'I'; // I: Internal (1.2V), O: Off-chip, E: External
              // -- Reloj de referencia
      SD16A_configuration->clk_ref = 'M'; // M: MCLK, S: SMCLK, A: AC1LK, T: TACLK
                                        // -- Divisor de frecuencia de referencia
      SD16A_configuration->clk_div_1 = 1;
      SD16A_configuration->clk_div_2 = 1;
      // -- Método de lectura: Polling o Interrupciones
      SD16A_configuration->interruption_SD16A = true;
      // -- Over Sampling Ratio
      SD16A_configuration->OSR = 512; // 1, 32, 64, 128, 256, 512, 1024
      // -- Ganancia
      SD16A_configuration->gain = 1; // 1, 2, 4, 8, 16 or 32
      // -- Método de conversión
      SD16A_configuration->conv_mode = 'C'; // C: Continuous  S: Single
                                          // -- Tipo de datos
      SD16A_configuration->polarity = 'B';  // B : Bipolar, U : unipolar
      SD16A_configuration->sign = 'O';      // O : Offset, C : 2's complement

      SD16A_configuration->sampled = false;
}
#endif
void config_SPI(SPI_config_struct* SPI_config){
  SPI_config->Master_Slave = 'M';       //M: MSB, L: LSB
  SPI_config->inactive_state = 'H';     // clock polarity inactive high
  //data cHanged on the first UCLK edge and captured on the following edge
  //data cAptured on the first UCLK edge and changed on the following edge
  SPI_config->data_on_clock_edge = 'H'; // data cAptured on the first UCLK edge and changed on the following edge
  SPI_config->SPI_length = 8;
  SPI_config->first_Byte_sent = 'M';
    /*clk_ref:
      U --> UCLK
      A --> ACLK
      S --> SMCLK
  */
  SPI_config->clk_ref_SPI = 'S';
  SPI_config->clk_div = 2;
  SPI_config->enable_USCI_interr_rx = false;
  SPI_config->enable_USCI_interr_tx = false;
}

void config_SPI_stim(SPI_config_struct* SPI_config){
  SPI_config->Master_Slave = 'M';       //M: Master, S: Slave
  SPI_config->inactive_state = 'L';     // clock polarity inactive low
  //data cHanged on the first UCLK edge and captured on the following edge
  //data cAptured on the first UCLK edge and changed on the following edge
  SPI_config->data_on_clock_edge = 'A'; 
  SPI_config->SPI_length = 8;
  SPI_config->first_Byte_sent = 'M'; //M: MSB, L: LSB
    /*clk_ref:
      U --> UCLK
      A --> ACLK
      S --> SMCLK
  */
  SPI_config->clk_ref_SPI = 'S';
  SPI_config->clk_div = 2;
  SPI_config->enable_USCI_interr_rx = false;
  SPI_config->enable_USCI_interr_tx = false;
}

void init_SPI_for_Intan(uint16_t clk_divisor) {
    // Poner en reset al USCI_A0
    UCA0CTL1 |= UCSWRST;

    // Limpiar todos los registros USCI_A0
    UCA0CTL0 = 0;        // Borra CPOL, CPHA, MSB/LSB, modo master/slave, síncrono
    UCA0CTL1 = 0;
    UCA0BR0 = 0;
    UCA0BR1 = 0;
    UCA0MCTL = 0;

    // Limpiar pines de selección
    P2SEL &= ~(BIT4 | BIT5);
    P3SEL &= ~BIT0;

    // Configuración de pines SPI
    P2SEL |= BIT4 | BIT5; // SIMO, SOMI
    P3SEL |= BIT0;         // CLK

    // Configuración USCI_A0 en SPI Master, MSB first, Mode 0
    UCA0CTL0 = UCMST   // Master
             | UCSYNC  // Síncrono
             | UCMSB;  // MSB first
    // CPOL=0, CPHA=0, por defecto

    // Fuente de clock: SMCLK
    UCA0CTL1 |= UCSSEL_2;

    // Divisor de reloj
    UCA0BR1 = clk_divisor / 256;
    UCA0BR0 = clk_divisor % 256;

    // Sin modulación
    UCA0MCTL = 0;

    // Quitar reset → activar USCI_A0
    UCA0CTL1 &= ~UCSWRST;
}




int main(void) {
    general_setup(CLK_config);
    init_MSP();

    //************************** CLK configuration *****************************
    
    setup_CLK(CLK_config);

    //************************** LED configuration *****************************
    toggle_setup(); // Setup P4.6 for LED output
  #if (TEST_CLK)
    configure_PINS_for_clk_debug();

  #else

  #if (SENSE_OR_STIM==3)
      config_SPI_stim(&SPI_config);
      // config_SPI(&SPI_config);
      SPI_setup(&SPI_config);


      // init_SPI_for_Intan(2);
      INTAN_LED_setup(); // Setup P4.3 for LED output
      OFF_INTAN_LED();

      initialize_INTAN(&INTAN_config);
    
  #else
    #if (UART_USAGE)
      //************************** UART configuration *****************************
      setup_UART(UART_config);

    #else
      //************************** SPI configuration *****************************
      config_SPI(&SPI_config);
      SPI_setup(&SPI_config);

    #endif
  #endif

  #if (SENSE_OR_STIM==1)
    #if (SD16_USAGE)
      //************************** SD16 configuration *****************************
      config_SD16A(&SD16A_configuration);
      setup_SD16A(&SD16A_configuration);
      enable_interruption_SD16A(true);
      start_conversion(); // While it is started, working in continuous mode will
                          // sample the channel A until it is stopped
    #endif
      UCA0TXBUF = 0x45; // Transmit first character

      enable_interruptions(true);

      IE2 |= UCA0RXIE+UCA0TXIE; // Enabling UART interrupt
  
