alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/IKKI/IKKI_main.c
  #elif(SENSE_OR_STIM == 2)
      UCA0TXBUF = SD16A_configuration.analog_input_ID[SD16A_configuration.analog_input_being_sampled];

      //************************** SD16 configuration *****************************
      config_SD16A(&SD16A_configuration);
      setup_SD16A(&SD16A_configuration);
      start_conversion(); // While it is started, working in continuous mode will

      SD16CCTL0 &= ~(SD16IE);   // Disabling SD16 interrupt
      IE2 &= ~(UCA0RXIE|UCA0TXIE);  // Disabling UART interrupt
      while(1){
        if (state == 1){
          my_register = SD16MEM0; // Save CH0 results (clears IFG)

          // 1. select_analog_input(SD16A_configuration.analog_input[SD16A_configuration.analog_input_being_sampled]);
          // First, clean the bits so to not have more than one channel reading
          SD16INCTL0 &=  ~(SD16INCH_0 | SD16INCH_1 | SD16INCH_2 | SD16INCH_3 | SD16INCH_4);
          SD16INCTL0 |= SD16A_configuration.analog_input[SD16A_configuration.analog_input_being_sampled];
          #if (ECG_or_EEG != 1)
            // 2. Wait for stability
            __delay_cycles(1600);        // 12.5 µs @ 8 MHz

            // 3. Start conversion and discard
            SD16CCTL0 |= SD16SC;
            while (!(SD16CCTL0 & SD16IFG));
            volatile int dummy = SD16MEM0;   // discard
          #endif

          // 4. Do real lecture
          SD16CCTL0 |= SD16SC;
          while (!(SD16CCTL0 & SD16IFG));
          
          my_register = SD16MEM0; // Save CH0 results (clears IFG)

          // Update the channel to be read the next
          SD16A_configuration.analog_input_being_sampled++;
          if (SD16A_configuration.analog_input_being_sampled == SD16A_configuration.analog_input_count) {
            SD16A_configuration.analog_input_being_sampled = 0;
          }
          high_word = (my_register >> 8) & 0xFFFF; // 8 bits superiores (0x1234)
          low_word = my_register & 0xFFFF;         // 8 bits inferiores (0x5678)
          state = 3;

        } else if (state == 3) {
            while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
            UCA0TXBUF = SD16A_configuration.analog_input_ID[SD16A_configuration.analog_input_being_sampled];
            while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
            UCA0TXBUF = high_word;    // Envía el byte alto
            while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
            UCA0TXBUF = low_word;     // Envía el byte bajo
            while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
            state = 1;                // Solo aquí finalizamos la transmisión completa de los bytes
          }
        }
 


    #elif(SENSE_OR_STIM == 3)
      CS_setup();
      ON_CS_pin();
      stim_en_setup();
      button_init();

      INTAN_config.step_sel = 1000;

      INTAN_config.target_voltage = 1.2;
      INTAN_config.CL_sel = 1;
      stim_en_OFF();
      // create_example_SPI_arrays(&INTAN_config);
      // create_stim_SPI_arrays(&INTAN_config);

      // check_intan_SPI_array(&INTAN_config);
      // clear_command(&INTAN_config);


      // while(pckt_count != INTAN_config.max_size){       
      //   if (state == 1){
      //     update_packets(pckt_count, &packet_1, &packet_2, &packet_3, &packet_4, INTAN_config);
      //     pckt_count++;
      //     state = 2;      
      //   }
      //   else if (state == 2){
      //     OFF_CS_pin();
      //     state = 1;
      //     while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
      //     UCA0TXBUF = packet_1;
      //     while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
      //     UCA0TXBUF = packet_2;
      //     while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
      //     UCA0TXBUF = packet_3;
      //     while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
      //     UCA0TXBUF = packet_4;
      //     while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
      //     ON_CS_pin();           
      //   }
      // }
      //   bool next_stim =true;

      // while(1){
      //   next_stim = button_pressed();
      //   if(next_stim == true){
      //     ON_pin();
      //     num_stim = NUM_STIM_EXP;
      //     while(num_stim > 0){
      //           // stim_en_ON();
      //           // wait_30_seconds();
      //           // stim_en_OFF();
      //           // wait_5_mins();
                
      //           stim_en_ON();
      //           wait_3_seconds();
      //           stim_en_OFF();
      //           wait_5_seconds();
                
      //           num_stim--;
      //     }
      //     OFF_pin();
      //   }
      // }
      


      while(1){
        bool next_stim = button_pressed();
        if(next_stim == true){
          // check_intan_SPI_array(&INTAN_config);

          // read_command(&INTAN_config, STIM_ENABLE_A_reg);
          // read_command(&INTAN_config, STIM_ENABLE_B_reg);

          // write_command(&INTAN_config, STIM_ENABLE_A_reg,0x0000);
          // write_command(&INTAN_config, STIM_ENABLE_B_reg,0x0000);

          // clear_command(&INTAN_config);

          // read_command(&INTAN_config, STIM_ENABLE_A_reg);
          // read_command(&INTAN_config, STIM_ENABLE_B_reg);

          // write_command(&INTAN_config, 0x00,0x0000);
          // read_command(&INTAN_config, 0x00);

          // INTAN_config.fh_magnitude = 7.5;
          // INTAN_config.fh_unit = 'k';

          // fc_high(&INTAN_config); //TODO crear una variable para K y para 7.5 y que se pueda configurar al inicio del todo
          // read_command(&INTAN_config, ADC_HIGH_FREQ_4);
          // read_command(&INTAN_config, ADC_HIGH_FREQ_5);
          // fc_low_A(&INTAN_config, 5.0);
          // fc_low_B(&INTAN_config, 1000);
          // read_command(&INTAN_config, ADC_LOW_FREQ_A);
          // read_command(&INTAN_config, ADC_LOW_FREQ_B);


          // Functions for enabling and disabling flags
          // enable_M_flag(&INTAN_config);
          // enable_U_flag(&INTAN_config);
          // enable_H_flag(&INTAN_config);
          // enable_D_flag(&INTAN_config);

