alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/IKKI/IKKI_main.c
          /*Conversion of channels*/
          // convert_channel(&INTAN_config, 0);
          // convert_channel(&INTAN_config, 14);
          // convert_N_channels(&INTAN_config);

          /*stimulation current configuration */
          // stim_step_DAC_configuration(&INTAN_config);
          // stim_PNBIAS_configuration(&INTAN_config);

          // stim_current_channel_configuration(&INTAN_config, 4, 15, 15, 15, 15);

          // Compliance monitor related functions
          // clean_compliance_monitor(&INTAN_config);
          // check_compliance_monitor(&INTAN_config);
          // connect_channel_to_gnd(&INTAN_config, 8);
          // connect_channel_to_gnd(&INTAN_config, 2);
          // connect_channel_to_gnd(&INTAN_config, 0);

          // Current and voltage limited charge recovery circuit configuration
          // charge_recovery_current_configuration(&INTAN_config);
          // charge_recovery_voltage_configuration(&INTAN_config);
          // INTAN_config.voltage_recovery = 0;
          // charge_recovery_voltage_configuration(&INTAN_config);
          // INTAN_config.voltage_recovery = 1.225;
          // charge_recovery_voltage_configuration(&INTAN_config);

          // INTAN_config.ADC_sampling_rate = 100;
          // ADC_sampling_rate_config(&INTAN_config);
          // INTAN_config.ADC_sampling_rate = 130;
          // ADC_sampling_rate_config(&INTAN_config);
          // INTAN_config.ADC_sampling_rate = 150;
          // ADC_sampling_rate_config(&INTAN_config);          
          // INTAN_config.ADC_sampling_rate = 210;
          // ADC_sampling_rate_config(&INTAN_config);
          // INTAN_config.ADC_sampling_rate = 260;
          // ADC_sampling_rate_config(&INTAN_config);
          // INTAN_config.ADC_sampling_rate = 300;
          // ADC_sampling_rate_config(&INTAN_config);
          // INTAN_config.ADC_sampling_rate = 370;
          // ADC_sampling_rate_config(&INTAN_config);
          // INTAN_config.ADC_sampling_rate = 440;
          // ADC_sampling_rate_config(&INTAN_config);
          // INTAN_config.ADC_sampling_rate = 500;
          // ADC_sampling_rate_config(&INTAN_config);

          // impedance_check_control(&INTAN_config);
          // INTAN_config.zcheck_select = 5;
          // INTAN_config.zcheck_DAC_enhable = 1;
          // INTAN_config.zcheck_load = 1;
          // INTAN_config.zcheck_scale = 1;
          // INTAN_config.zcheck_en = 1;
          // impedance_check_control(&INTAN_config);
          // INTAN_config.zcheck_select = 2;
          // INTAN_config.zcheck_DAC_enhable = 1;
          // INTAN_config.zcheck_load = 0;
          // INTAN_config.zcheck_scale = 0;
          // INTAN_config.zcheck_en = 1;
          // impedance_check_control(&INTAN_config);


          // impedance_check_DAC(&INTAN_config);
          // INTAN_config.zcheck_DAC_value = 255;
          // impedance_check_DAC(&INTAN_config);
          // INTAN_config.zcheck_DAC_value = 8;
          // impedance_check_DAC(&INTAN_config);
          
          
          // // Fault current detection
          // fault_current_detection(&INTAN_config);


          // // Enabling and controlling the digital external outputs 
          // enable_digital_output_1(&INTAN_config);
          // enable_digital_output_2(&INTAN_config);
          // disable_digital_output_1(&INTAN_config);
          // disable_digital_output_2(&INTAN_config);


          // power_ON_output_1(&INTAN_config);
          // power_ON_output_2(&INTAN_config);
          // power_OFF_output_1(&INTAN_config);
          // power_OFF_output_2(&INTAN_config);

          // // Enables and disables C2 compliment dynamically if needed
          // enable_C2(&INTAN_config);
          // disable_C2(&INTAN_config);

          // // Enable and disable absolute values
          // enable_absolute_value(&INTAN_config);
          // disable_absolute_value(&INTAN_config);

          // // Digital signal processing filter HPF enable or disable
          // disable_digital_signal_processing_HPF(&INTAN_config);
          // enable_digital_signal_processing_HPF(&INTAN_config);

          // INTAN_config.DSP_cutoff_freq = 1.2;
          // INTAN_config.ADC_sampling_rate = 30000;
          // INTAN_config.number_channels_to_convert = 1;

          // DSP_cutoff_frequency_configuration(&INTAN_config);

          // minimum_power_disipation(&INTAN_config);

          // check_compliance_monitor(&INTAN_config);

          // power_up_AC(&INTAN_config);

          // INTAN_config.amplifier_cutoff_frequency_A_B[0] = 'B';
          // INTAN_config.amplifier_cutoff_frequency_A_B[8] = 'B';
          // A_or_B_cutoff_frequency(&INTAN_config);

          // INTAN_config.amplfier_reset[5] = true;
          // amp_fast_settle(&INTAN_config);

          // A_or_B_cutoff_frequency(&INTAN_config);

          // amp_fast_settle_reset(&INTAN_config);


          state = 1;
          send_SPI_commands(&INTAN_config);
          while(next_stim == true){
            next_stim = button_pressed();
          }
        }
      }
    #endif
  #endif
}




#if (SENSE_OR_STIM == 1 && TEST_CLK == false)

  //***************************************************************************** 
  //Interrupción de la UART
  //***************************************************************************** 
  #if (UART_USAGE == true)
      //TX interrupt handler
    #if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
    #pragma vector=USCIAB0TX_VECTOR
    __interrupt void USCI_A0_Tx (void)
    #elif defined(__GNUC__)
    void __attribute__ ((interrupt(USCIAB0TX_VECTOR))) USCI_A0_Tx (void)
    #else
    #error Compiler not supported!
    #endif
    {
      if (state == 1) {
        UCA0TXBUF = SD16A_configuration.analog_input_ID[SD16A_configuration.analog_input_being_sampled];
        state = 2;
        SD16CCTL0 |= SD16IE;         // Enabling SD16 interrupt
        IE2 &= ~(UCA0RXIE+UCA0TXIE);          // Disabling SPI interrupt
      }else if (state == 3) {
        if (high_or_low) {
          UCA0TXBUF = high_word;      // Envía el byte alto
          high_or_low = !high_or_low; // Alterna entre alto y bajo

        } else {
          UCA0TXBUF = low_word;       // Envía el byte bajo
          state = 1;                  // Solo aquí finalizamos la transmisión completa de los bytes
          SD16CCTL0 &= ~(SD16IE);     // Disabling SD16 interrupt
          IE2 |= UCA0RXIE+UCA0TXIE;   // Enabling SPI interrupt

          high_or_low = !high_or_low; // Alterna entre alto y bajo
        }
      }
    }

  #else
    //*****************************************************************************
    // Interrupción del SPI
    //*****************************************************************************
    
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCIAB0RX_VECTOR
__interrupt void USCIA0RX_ISR(void)
#elif defined(__GNUC__)
void __attribute__((interrupt(USCIAB0RX_VECTOR))) USCIA0RX_ISR(void)
#else
#error Compiler not supported!
#endif
    {
      if (state == 1) {
        
        UCA0TXBUF = SD16A_configuration.analog_input_ID[SD16A_configuration.analog_input_being_sampled];
        state = 2;
        SD16CCTL0 |= SD16IE;         // Enabling SD16 interrupt
        IE2 &= ~(UCA0RXIE+UCA0TXIE);          // Disabling SPI interrupt

