alimudena/INTAN-RHS2116/0 new common-port/port/MSP430FG479/IKKI/IKKI_main.c
      }else if (state == 3) {
        if (high_or_low) {
          UCA0TXBUF = high_word;      // Envía el byte alto
          high_or_low = !high_or_low; // Alterna entre alto y bajo

        } else {
          UCA0TXBUF = low_word;       // Envía el byte bajo
          state = 1;                  // Solo aquí finalizamos la transmisión completa de los bytes
          SD16CCTL0 &= ~(SD16IE);     // Disabling SD16 interrupt
          IE2 |= UCA0RXIE+UCA0TXIE;   // Enabling SPI interrupt

          high_or_low = !high_or_low; // Alterna entre alto y bajo
        }
      }
    }
  #endif




  //*****************************************************************************
  // Interrupción del SD16_A
  //*****************************************************************************
  #if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
  #pragma vector = SD16A_VECTOR
  __interrupt void SD16ISR(void)
  #elif defined(__GNUC__)
  void __attribute__((interrupt(SD16A_VECTOR))) SD16ISR(void)
  #else
  #error Compiler not supported!
  #endif
  {
    switch (SD16IV) {
    case 2: // SD16MEM Overflow
      state = 5;
      break;
    case 4: // SD16MEM0 IFG
      if (state == 2) {
       
        // 1. select_analog_input(SD16A_configuration.analog_input[SD16A_configuration.analog_input_being_sampled]);
        // First, clean the bits so to not have more than one channel reading
        SD16INCTL0 &=  ~(SD16INCH_0 | SD16INCH_1 | SD16INCH_2 | SD16INCH_3 | SD16INCH_4);
        SD16INCTL0 |= SD16A_configuration.analog_input[SD16A_configuration.analog_input_being_sampled];
        #if (ECG_or_EEG != 1)
        // 2. Wait for stability
        __delay_cycles(2000);        // 12.5 µs @ 8 MHz

        // 3. Start conversion and discard
        SD16CCTL0 |= SD16SC;
        while (!(SD16CCTL0 & SD16IFG));
        volatile int dummy = SD16MEM0;   // discard
        #endif

        // 4. Do real lecture
        SD16CCTL0 |= SD16SC;
        while (!(SD16CCTL0 & SD16IFG));
        
        my_register = SD16MEM0; // Save CH0 results (clears IFG)

        // Update the channel to be read the next
        SD16A_configuration.analog_input_being_sampled++;
        if (SD16A_configuration.analog_input_being_sampled == SD16A_configuration.analog_input_count) {
          SD16A_configuration.analog_input_being_sampled = 0;
        }
        high_word = (my_register >> 8) & 0xFFFF; // 8 bits superiores (0x1234)
        low_word = my_register & 0xFFFF;         // 8 bits inferiores (0x5678)
        state = 3;
        IE2 |= UCA0RXIE+UCA0TXIE;                // Enabling SPI interrupt
        SD16CCTL0 &= ~(SD16IE);                  // Disabling SD16 interrupt
      } else {
        IE2 |= UCA0RXIE+UCA0TXIE;                // Enabling SPI interrupt
        SD16CCTL0 &= ~(SD16IE);                  // Disabling SD16 interrupt
      }
      break;
    }
  }
#endif
